[
  {
    "slug": "phd-expectations",
    "title": "What's Expected During a PhD: The Implicit Contract",
    "date": "2026-01-15",
    "excerpt": "The working relationship between PhD students and advisors is built on expectations that are rarely stated explicitly. This post tries to make them visible.",
    "tags": [
      "phd",
      "advising",
      "graduate-school",
      "mentorship",
      "research",
      "career-advice"
    ],
    "filename": "phd-expectations.md"
  },
  {
    "slug": "phd-admissions-reality",
    "title": "Understanding PhD Admissions: How the Process Actually Works",
    "date": "2025-11-18",
    "excerpt": "Demystifying PhD admissions from faculty perspective - what committees actually evaluate, why the process feels opaque, and what applicants can control during the application process.",
    "tags": [
      "phd",
      "admissions",
      "graduate-school",
      "applications",
      "advice",
      "career-advice"
    ],
    "filename": "phd-admissions-reality.md"
  },
  {
    "slug": "internships-support-not-define",
    "title": "Internships Should Support Your Research, Not Define It",
    "date": "2025-10-24",
    "excerpt": "A frank discussion about how PhD students should think about internships - as strategic reinforcement of their research agenda, not as a substitute for developing one.",
    "tags": [
      "phd",
      "internships",
      "research",
      "career-advice",
      "industry",
      "graduate-school"
    ],
    "filename": "internships-support-not-define.md"
  },
  {
    "slug": "recommendation-letters",
    "title": "What Your Research Mentor Actually Writes About: A Guide to PhD Recommendation Letters",
    "date": "2025-08-15",
    "excerpt": "Understanding what faculty actually observe and evaluate when writing recommendation letters - from research contributions to collaboration skills to comparative rankings.",
    "tags": [
      "phd",
      "recommendation-letters",
      "academia",
      "mentorship",
      "career-advice",
      "graduate-school"
    ],
    "filename": "recommendation-letters.md"
  },
  {
    "slug": "effective-research-meetings",
    "title": "How to Have Effective Research Meetings as a PhD Student",
    "date": "2025-08-07",
    "excerpt": "A practical guide to running and participating in research meetings that actually move projects forward, written from a professor's perspective for students everywhere.",
    "tags": [
      "phd",
      "meetings",
      "research",
      "productivity",
      "advice",
      "academia"
    ],
    "filename": "effective-research-meetings.md"
  },
  {
    "slug": "painting-pots",
    "title": "Painting Pots: What a PhD Is Really About",
    "date": "2025-01-07",
    "excerpt": "For PhD applicants: understanding the true purpose of PhD education through an art studio analogy, and how this perspective can transform your interviews.",
    "tags": [
      "phd",
      "applications",
      "interviews",
      "research",
      "advice",
      "graduate-school"
    ],
    "filename": "painting-pots.md"
  },
  {
    "slug": "phd-survival-guide",
    "title": "PhD Survival Guide: Essential Resources for Academic Success",
    "date": "2024-06-15",
    "excerpt": "A curated collection of essential resources for graduate students and early-career researchers, covering research methodology, productivity, and academic career development.",
    "tags": [
      "phd",
      "graduate-school",
      "academia",
      "research",
      "productivity",
      "career-advice"
    ],
    "filename": "phd-survival-guide.md"
  }
]